Repository: Satys/Pimp
Catalog: lang/*/LC_MESSAGES/messages.po
Languages: pt_br

source: All versions 2.x are supported.
pt_br: Todas as versões 2.x são suportadas.

source: A flexible & easy-to-manage web server...
pt_br: Um flexível e fácil de gerenciar servidor web...

source: NCSA, IIS and W3C log formats are supported
pt_br: Formatos de log NCSA, IIS e W3C são suportados

source: The high performance reverse proxy, load balancer, edge cache, origin server
pt_br: Nginx é um servidor assíncrono

source: Default log formats are supported
pt_br: Os formatos padrões de log são suportados

source: PHP logs defined via the <code>error_log</code> ini parameter.
pt_br: Os logs do PHP são definidos através do parâmetro <code>error_log</code> do arquivo php.ini.

source: Pimp My Log has detected <code>%s</code> on your server.
pt_br: Pimp My Log detectou <code>%s</code> no seu servidor.

source: Pimp My Log has not detected any path in the ini parameter <code>error_log</code>.
pt_br: Pimp My Log não detectou nenhum caminho no parâmetro <code>error_log</code> do arquivo php.ini.

source: Activate this software only if you use <code>ini_set('error_log')</code> directly in your scripts for example.
pt_br: Ative este software apenas se você utilizar a diretiva <code>ini_set('error_log')</code> diretamente em seus scripts, por exemplo.

source: File <code>%s</code> already exists. Please remove it manually if you want me to create it.
pt_br: O arquivo <code>%s</code> já existe. Por favor remova-o manualmente se você quiser que eu crie este arquivo.

source: Unable to create file <code>%s</code>
pt_br: Não foi possível criar o arquivo <code>%s</code>

source: Please give temporary write access to the root directory:
pt_br: Favor fornecer permissão de escrita temporária ao diretório raiz:

source: Copy to clipboard
pt_br: Copiar para a área de trabalho

source: Command copied!
pt_br: Comando copiado!

source: Choose softwares to search log files for
pt_br: Escolha os softwares para procurar por arquivos de log

source: Files <code>%s</code> or <code>%s</code> do not exist. Please review your software configuration.
pt_br: Arquivos <code>%s</code> ou <code>%s</code> não existem. Favor verificar as configurações do seu software.

source: Unable to find any directory.
pt_br: Não é possível localizar qualquer diretório.

source: Check in the following list if these directories are readable by the webserver user and refresh this page
pt_br: Verifique na lista a seguir se estes diretórios possuem permissão de leitura pelo usuário do servidor web e recarregue esta página

source: Directories are available but unable to find files inside.
pt_br: Diretórios estão disponíveis mas não é possível procurar por arquivos dentro deles.

source: Check in the following list if these directories contain readable files by the webserver user and refresh this page.
pt_br: Verifique na lista a seguir se estes diretórios possuem arquivos com permissão de leitura pelo usuário do servidor web e recarregue esta página.

source: Don't forget that to read a file, ALL parent directories have to be accessible too!
pt_br: Não se esqueça que para ler um arquivo, TODOS os diretórios pais precisam estar acessíveis também!

source: These files have been checked in all paths: %s
pt_br: Estes arquivos foram verificados em todos os caminhos: %s.

source: Log files have been found!
pt_br: Arquivos de log foram encontrados!

source: Check in the following list files you want to configure. If files or directories are missing, verify that they are readable by the webserver user
pt_br: Verifique na lista a seguir os arquivos que você quer configurar. Se arquivos ou diretórios estiverem faltando, verifique se eles estão com permissão de escrita pelo usuário do servidor web

source: unable to detect web server user
pt_br: não é possível detectar o usuário do servidor web

source: web server user seems to be <code>%s</code>
pt_br: o usuário do servidor web parece ser <code>%s</code>

source: You can also type log files path in the text area below separated by coma:
pt_br: Você também pode digitar caminhos para os arquios de log na caixa de texto abaixo (separe por vírgula):

source: Type
pt_br: Tipo

source: Custom paths
pt_br: Caminhos personalizados

source: Unknown error
pt_br: Erro desconhecido

source: Custom files below are not readable, please remove them or verify that they are readable by the webserver user
pt_br: Os arquivos personalizados abaixo não possuem permissão de leitura, favor removê-los ou verificar se eles possuem permissão de leitura pelo usuário do servidor web

source: File <code>%s</code> does not define function <code>%s</code>. Please review your software configuration.
pt_br: O arquivo <code>%s</code> não define a função <code>%s</code>. Favor verificar as configurações do seu software.

source: No configuration found for softwares!
pt_br: Nenhuma configuração encontrada para os softwares!

source: Unknown action, abort.
pt_br: Ação desconhecida, abortar.

source: %s% Complete
pt_br: %s% Completo

source: An error occurs!
pt_br: Um erro ocorreu!

source: Please wait...
pt_br: Aguarde...

source: Path
pt_br: Caminho

source: File
pt_br: Arquivo

source: Readable
pt_br: Com permissão de leitura

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: Name
pt_br: Nome

source: Description
pt_br: Descrição

source: Notes
pt_br: Observações

source: You have to select at least one software to configure!
pt_br: Você tem que selecionar ao menos um software para configurar!

source: You have to select at least one log file or type the path of a log file!
pt_br: Você deve selecionar ao menos um arquivo de log ou digitar o caminho de um arquivo de log!

source: Configurator
pt_br: Configurador

source: Reload
pt_br: Recarregar

source: Continue
pt_br: Continuar

source: Congratulations!
pt_br: Parabéns!

source: Your <em>Pimp my Log</em> instance is ready to use.
pt_br: Sua instância do <em>Pimp my Log</em> está pronta para uso.

source: You can manually adjust settings in the <code>%s</code> file.
pt_br: Você pode ajustar manualmente as configurações no arquivo <code>%s</code>.

source: Please visit <a href="http://pimpmylog.com">pimpmylog.com</a> for more informations.
pt_br: Favor visitar <a href="http://pimpmylog.com">pimpmylog.com</a> para mais informações.

source: Pimp my Logs now!
pt_br: Pimp my Logs agora!

source: No file is defined in <code>files</code> array
pt_br: Nenhum arquivo está definido no vetor <code>files</code>

source: <code>%s</code> is mandatory for file ID <code>%s</code>
pt_br: <code>%s</code> é mandatório para o arquivo de ID <code>%s</code>

source: <strong>PHP Error</strong> line %s: %s
pt_br: <strong>PHP Error</strong> linha %s: %s

source: Please refresh the page.
pt_br: Favor atualizar a página.

source: File ID <code>%s</code> does not exist, please review your configuration file and stop playing!
pt_br: O arquivo de ID <code>%s</code> não existe. Favor reveja o seu arquivo de configuração e pare de brincar!

source: File <code>%s</code> for file ID <code>%s</code> does not exist, please review your configuration file.
pt_br: O arquivo <code>%s</code> para o arquivo de ID <code>%s</code> não exite. Favor reveja o seu arquivo de configuração.

source: Configuration file has changed and is buggy now. Please refresh the page.
pt_br: O arquivo de configuração foi modificado e agora está bugado. Favor recarregar a página.

source: File <code>%s</code> for file ID <code>%s</code> does not exist anymore...
pt_br: O arquivo <code>%s</code> para o arquivo de ID <code>%s</code> não existe mais...

source: Log file has been rotated (previous size was %s and new one is %s)
pt_br: O arquivo de log foi rotacionado (o tamanho anterior era %s e o novo é %s)

source: Log file has been rotated
pt_br: O arquivo de logs foi rotacionado

source: %s in <code>%sms</code> with <code>%s</code> of logs, <code>%s</code> skipped line(s), <code>%s</code> unreadable line(s).<br/>File <code>%s</code> was last modified on <code>%s</code> at <code>%s</code>, size is <code>%s</code>%s
pt_br: %s em <code>%sms</code> com <code>%s</code> de logs, <code>%s</code> linha(s) pulada(s), <code>%s</code> linha(s) ilegível(is).<br/>O arquivo <code>%s</code> foi modificado pela última vez em <code>%s</code> no fuso horário <code>%s</code>, o tamanho é <code>%s</code>%s

source: %s new logs found
pt_br: %s novos logs encontrados

source: no new log found
pt_br: nenhum novo log encontrado

source: 1 new log found
pt_br: 1 novo log encontrado

source: log type is <code>%s</code>
pt_br: o tipo do log é <code>%s</code>

source: Please touch file <code>inc/test.REMOVE_UPPERCASE.php</code> and reload this page
pt_br: Favor criar o arquivo <code>inc/test.REMOVE_UPPERCASE.php</code> e recarregue esta página

source: Error
pt_br: Erro

source: Match is not a valid associative array
pt_br: Match não é um array associativo válido

source: Types is not a valid associative array
pt_br: Types não é um array associativo válido

source: RegEx is not a valid PHP PCRE regular expression
pt_br: A expressão regular não é válida pelo padrão PHP PCRE

source: Regex tester
pt_br: Testador de Expressões Regulares

source: RegEx
pt_br: Expressão Regular

source: Match
pt_br: Correspondência

source: must be json encoded
pt_br: deve ser um JSON válido

source: Types
pt_br: Tipos

source: Multiline
pt_br: Múltiplas linhas

source: Test
pt_br: Teste

source: Regex samples
pt_br: Exemplos de expressões regulares

source: Rights
pt_br: Direitos

source: No POSIX functions...
pt_br: Funções POSIX indisponíveis...

source: Read
pt_br: Leitura

source: Write
pt_br: Escrita

source: Real path
pt_br: Caminho real

source: Current version %s
pt_br: Versão atual %s

source: Unable to check your current version!
pt_br: Não é possível verificar sua versão atual!

source: Error while fetching URL %s from the server hosting this Pimp my Log instance.
pt_br: Ocorreu um erro enquanto recebíamos a URL %s do servidor que hospeda esta instância do Pimp my Log.

source: Remote version broken!
pt_br: Versão remota quebrada!

source: Version %s released on %s
pt_br: Versão %s disponibilizada em %s

source: Version %s
pt_br: Versão %s

source: An upgrade is available !
pt_br: Uma atualização está disponível !

source: You have version %s and version %s is available
pt_br: Você possui a versão %s e a versão %s está disponível

source: release notes
pt_br: notas da versão

source: Simply <code>git pull</code> in your directory or <a href="http://pimpmylog.com/getting-started/#update" target="doc">follow instructions here</a>
pt_br: Simplesmente execute <code>git pull</code> no seu diretório ou <a href="http://pimpmylog.com/getting-started/#update" target="doc">siga as instruções aqui</a>

source: Don't bother me again with this upgrade!
pt_br: Não me incomode novamente com esta atualização!

source: You should upgrade right now:
pt_br: Você deve atualizar agora:

source: Your version %s is out of date
pt_br: Sua versão %s está desatualizada

source: Your version %s is up to date
pt_br: Sua versão %s está atualizada

source: Unable to fetch URL %s from the server hosting this Pimp my Log instance.
pt_br: Não é possível obter a URL %s do servidor que está hospedando esta instância do Pimp my Log.

source: Unable to check remote version!
pt_br: Não é possível verificar a versão remota!

source: PHP version %s is required but your server run %s.
pt_br: A versão %s ou superior do PHP é necessária mas o seu servidor está executando a versão %s.

source: Learn more
pt_br: Saiba mais

source: Welcome!
pt_br: Bem vindo!

source: Pimp my Log is not configured.
pt_br: Pimp my Log não está configurado.

source: You can manually copy <code>cfg/config.example.json</code> to <code>config.user.json</code> in the root directory and change parameters. Then refresh this page.
pt_br: Você pode copiar manualmente o arquivo <code>cfg/config.example.json</code> para <code>config.user.json</code> no diretório raiz para modificar os parâmetros. Depois de fazer isso, recarregue esta página.

source: Or let me try to configure it for you!
pt_br: Ou deixe-me tentar configurá-lo para você.

source: Configure now
pt_br: Configurar agora

source: <code>config.user.json</code> configuration file is buggy:
pt_br: O arquivo de configuração <code>config.user.json</code> está bugado:

source: If you want me to build the configuration for you, please remove file <code>config.user.json</code> at root and click below.
pt_br: Se você quer que eu construa a configuração para você, por favor remova o arquivo <code>config.user.json</code> no diretório raiz e clique abaixo.

source: Notifications are denied for this site. Go to your browser preferences to enable notifications for this site.
pt_br: Notificações estão bloqueadas para este site. Vá para as preferências do seu navegador para ativar as notificações para este site.

source: No log has been found.
pt_br: Nenhum log foi encontrado.

source: Search was done with RegEx engine
pt_br: Busca efetuada com o motor de Expressões Regulares.

source: Search was done with regular engine
pt_br: Busca efetuada com o motor padrão.

source: No log has been found with regular search %s
pt_br: Nenhum log foi encontrado com a busca padrão %s

source: No log has been found with Reg Ex search %s
pt_br: Nenhum log foi encontrado com a busca por Expressões Regulares %s

source: New logs are available
pt_br: Novos logs disponíveis

source: 1 new log is available
pt_br: 1 novo log está disponível

source: %s new logs are available
pt_br: %s novos logs estão disponíveis

source: 1 log displayed,
pt_br: 1 log exibido,

source: %s logs displayed,
pt_br: %s logs exibidos,

source: Reload the page with default parameters
pt_br: Recarregue a página com os parâmetros iniciais.

source: Click to refresh or press the R key
pt_br: Clique em recarregar ou pressione a tecla R

source: Select a log file to display
pt_br: Selecione um arquivo de log para exibir

source: Search in logs
pt_br: Buscar nos logs

source: Select a duration to check for new logs automatically
pt_br: Selecione o período para verificar por novos logs automaticamente

source: No auto refresh
pt_br: Sem atualização automática

source: Refresh every %ss
pt_br: Atualizar a cada %ss

source: Max count of logs to display
pt_br: Número máximo de logs a exibir

source: Desktop notifications on supported modern browsers
pt_br: Notificações de área de trabalho nos navegadores modernos que o suportam

source: Wide view
pt_br: Vista expandida

source: on
pt_br: ligado

source: off
pt_br: desligado

source: Language
pt_br: Idioma

source: Change language...
pt_br: Alterar idioma...

source: Timezone
pt_br: Fuso horário

source: Change timezone...
pt_br: Alterar o fuso horário
